ACKNOWLEDGEMENT = ['Доступны для изучения: ', 'Выберите технологию для изучения: ',
                   'Введите корректное название ремесла: ', 'Доступны для изучения: ',
                   'Выберите технологию для изучения: ', 'Введите корректное название ремесла: ']

MOULIN_ROUGE = 'Увеселительное кабарэ для молодых и взрослых бизнес-информатиков и бизнес-информатичек,\
     где можно отдохнуть и телом и душой!'

CHURCH = 'Церковь построена, милорд!'

ACCOUNTING_CHAMBER = 'Теперь у вас есть счетная палата.'

WINDMILL = 'Мельница готова, король!'

BARRACKS = 'Казармы готовы, Ваше Величество'

CATTLE_BREEDING = 'Вы изучили скотоводство, теперь вы будете получать больше еды'

AGRICULTURE = 'Вы изучили земеледелие, теперь вы будете получать больше еды.'

SAILING = 'Вы изучили мореходство. Теперь вы можете ловить рыбу и торговать ей! У вас также появились военные корабли.'

HUNTING = 'Вы познали искусство охоты. Бизнес информатики будут добывать для вас мясо!'

WARFARE = 'Вы постигли новых высот в военном деле, поздравляю мой государь!'

RELIGION = 'Вы приняли религию, теперь можете построить церковь.\
     Это существенно сократит протестные настроения в стране.'

MASONRY = 'Вы изучили каменную кладку. Вам доступны новые постройки и ресурсы.'

RIVALRY = 'Честь, отвага и благородие отныне не чужды бизнес информатикам. Ожидайте турниры в вашу честь!'

SEED_OWN = ['Король, сколько зерна песеять?', 'Король, сколько зерна раздать людям?',
            'Год был не урожайным, мы  выростили мало.', 'Просто замечательный сезон, мы вырастили в двое больше!',
            'Хороший урожай, милорд.', 'Ужасный урожай, милорд. Мы не вырастили ничего!',
            'Такими темпами в стране начнется голод!', 'Смута: +5']

SEED_SELL = ['Король, соседнее государство хочет купить зерно(2 золотых за зернышко). Сколько продать?',
             'Не хватает зерна.']

SEED_BUY = ['Король, соседнее государство готово продать зерно(2 золотых за зернышко). Сколько купить?',
            'Не хватает денег.']

WAR = ['Король Испании развязал войну на Севере. Он просит Вас принять участие в ней на его стороне. \
       Желаете принять участие? (30 солдат, 5 000 золотых). В случае победы Испания обещает вам 12 000 золотых.',
       'ДА', 'НЕТ', 'Король, у Вас недостаточно ресурсов.']

WAR_EXODUS = ['Испанский Король проиграл войну.', 'Испания побеждает в войне!!!',
              'Нашему государству ничего не достанется, Кололь.', 'Смута: +3',
              'В казну поступили обещанные 12 000 золотых. Из 100 солдат выжило только 25.']

SEPARATISM = ['Король, Северное графство выступило против Вас и хочет отделиться? Отправить войска?',
              'Восстание подавлено!', 'Нам не удалось подавить сепаратистов...',
              'ДА', 'Сколько людей отправить?', 'Не хватает солдат.',
              'Ни один солдат не вернулся.', 'Замля: -30', 'Народ: -15',
              'Армия -', 'Смута: +3', 'НЕТ', 'Замля: -30', 'Народ: -15']

DISCOVERY = ['Король, наши ученые предлагают отправить экспедицию на Юг(10 человек). Дадите свое согласие и\
 средства(1 000 золотых)', 'ДА', 'Деньги: -1000', 'Народ: -10', 'НЕТ',
             'Король, экспедиционный корпус вернулся с открытиями и ресурсами!',
             'Король, нмикто не вернулся из экспедиции.', "Смута: -10", 'Зерно: +420',
             'Замля: +40', 'Король, экспедиционый корпус не вернулся']

SPY = ['Король, до нас доли слухи, что в стране есть шпионы. Усилить гарнизон? (320 золотых?)',
       'ДА', "Шпион пойман! Мы смогли предовратить диверсию!", 'Слухи остаются слухами.',
       'Смута: -3', 'Деньги: -320', 'Деньги: -320', 'НЕТ', 'Слухи оказались правдой.\
        Шпион ограбил казну и убил несколько придворных.', 'Слухи остаются слухами.', 'Смута: +13', 'Деньги: -520']

HUSBRANDY = ['Король, сколько земли выделить для выпаски скота?', 'Замля -', 'Еда +', 'Замля -', 'Еда +']

WIZARD = ["Король, у входа в дворец стоит странник. Он называет себя чародеем и просит встречи с Вашим высочеством. \
    Нам впустить его?", 'ДА', 'Чародей: Здравствуйте Король, давайте сыграем  в одну игру?', '*Ваш ответ Король*:',
          'ДА', 'Чародей: Я загадываю одно слово из: Дракон, Рыцарь, Меч, Огонь. А вы должни отгадать. \n \
            Если победите подряд два раза, одним щелчком пальцев  решу ваши проблемы в стране, но за каждый \
            проигрыш отдаете мне 50 золотых. Вы готовы? \n (Введите да или нет)', 'ДА', 'Дракон', 'Рыцарь',
          'Меч', 'Огонь', 'Я загадал. Ваш ответ.', 'Правильно. Идем дальше?', 'НЕТ', 'ДА',
          'Увы, вы ошиблись. Идем дальше?', 'НЕТ', 'До встречи, Король.', 'ДА',
          'Кажется вы победили, Король. Вот Ваш приз.', 'НЕТ', 'До встречи, Король.']

FISH_SELL = ['Король, царь соседнего госудаоства готов купить у нас немного рыбы. (2 ве золотых за штуку.',
             'Сколько рыбы прождать?: ', 'Не хватает рыбы. Введите другое значение.', 'Еда: -', 'Деньги: +',
             'Еда: -', 'Деньги: +']

BUILDING = ['Вы можете построить: ', 'Введите название постройки: ', 'Введите корректное название постройки: ']

RES_CHANGES = ['Земля:', 'Жители:', 'Смута:', 'Зерно:', 'Деньги:', 'Армия:', 'Вы построили:']

GIVE_ANSWER = 'Мой король, не могли бы вы повторить'

VILLAGE_FIRE = 'Король, в одной из наших деревень произошёл пожар! Погибли жители, сгорела земля и часть зерна!'

CITY_FIRE = 'Король, в одном из наших городов произошёл пожар! Погибли жители, сгорела часть денег!'

FLOOD = 'Король, произошло наводнение! Вода смыла наши посевы и унесла жизни нескольких сельчан!'

CONSPIRACY = ['Король, против вас готовится заговор. ', 'Мы можем нанять шпиона(1), который отловит всех заговорщиков,\
 или ждать, пока они сделают первый шаг(2)']

STRIKE = ['Рабочие устроили забастовку.', 'Мы можем отдать им часть денег и зерна(1) или нам придется и дальше смотреть\
 на этот беспредел (2)']

PLAGUE_AFTER = 'Жители: -10 (Чума)'

PLAGUE = 'На юге нашего царства появилась началась какая-то эпидемия,\
никто из наших докторов ни разу не встречался с подобным!'

NEW_WORLD = 'Где-то в дальных землях Колумб открывает Америку!'

COLUMBUS_LOSE = 'Экспедиция Колумба попала в шторм, никто не выжил.'

COLUMBUS_WIN = 'Колумб достиг Америки! Экспедиция закончилась успешно! И прошла она далеко не зря: '

COLUMBUS = ['Какой-то бродяга с улицы по имени Колумб собирает средства на экспедицию для\
     поиска нового пути в Индию, милорд.\n Он просит вас проспонсировать его,\
      ему нужно 50 золота: ', '(1 - дать; 2 - отказаться)']

BRILLIANTS = 'Ваши подданые нашли пещеру с бриллиантами!'

FOREST = 'Деньги: +10 (Лес)'

FOREST_TERRITORY = ['Сельчане просят ваше разрешение на срубку леса, чтобы построить себе новые дома ',
                    '(1 - дать разрешение, 2 - оставить лес) ']

ROAD = 'Наши рабочие построили Золотой путь!(+100 к золоту каждый ход)'

CRUEL_WINTER = ['Началась зима', 'Мы будем терять 100 единиц зерна каждый ход до её окончания']

TOURNAMENT = ['Начался ежегодный рыцарский турнир в вашу честь! Это большой праздник для всего вашего королевства!',
              'Смута сбрасывается до 40% от текущей']

ELEPHANTS = ['Торговец из Кении предлагает вам купить африканских слонов за 200 монет. ',
             '(1 - купить, 2 - и коней хватит) ', 'Отличные слоны!']

HUNT = 'Охота:'

PARADE = 'Парад в столице'

CHILD = 'Поздравляю с рождением принца, мой король!'

INDIAN_SUCCESS = 'Вернулась экспедиция из Индии!!!'

INDIA = ['Купцы хотят отправиться в Индию,\
         но для путешествия им нужно сопровождение,\
          они просят у вас часть армии (50 войнов). ',
         '(1) - отправить войнов. (2) - отказаться от предложения. ']

FISHING = 'Рыбалка (1 лодка: -40 золота, +120 еды) (Сколько лодок вы хотите купить): '

PIRATES = 'Пираты напали на наши торговые суда!'

WONDERS = ['"Большое плато"', 'озеро "Виктория"', '"Большой барьерный риф"', '"Копи царя Соломона"',
           '"Эльдорадо"', '"Источник молодости"', '"Гибралтар"', 'гора "Фудзиями"', 'Вы обнарушили чудо природы:']

HEROES = ['Чингисхан', 'Тамерлан', 'Наполеон', 'Юлий Цезарь', 'Георгий Жуков', 'Александр Невский']

HERO = 'У вас в армии появляется великий полководец'

CITY_STATES = ['Сингапур', 'Монако', 'Ватикан', 'Гонконг', 'Макао']

CITY_STATE = ['Вы нашли город-государство', 'Его жители присягают вам на веру!']

END = 'Ваше правление не назовешь успешным, народ бизнес-информатиков\
 не хочет более видеть столь беспомощного правителя...'
